{"keras_version": "2.0.6", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 256, 256, 3], "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"name": "block1_conv1", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"name": "block1_conv2", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"name": "block1_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": false, "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"name": "block2_conv1", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 128, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"name": "block2_conv2", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 128, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"name": "block2_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": false, "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"name": "block3_conv1", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 256, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"name": "block3_conv2", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 256, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"name": "block3_conv3", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 256, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_conv4", "config": {"name": "block3_conv4", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 256, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"name": "block3_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": false, "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"name": "block4_conv1", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"name": "block4_conv2", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"name": "block4_conv3", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_conv4", "config": {"name": "block4_conv4", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"name": "block4_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": false, "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"name": "block5_conv1", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"name": "block5_conv2", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"name": "block5_conv3", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_conv4", "config": {"name": "block5_conv4", "kernel_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "filters": 512, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"name": "block5_pool", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}, {"name": "sequential_1", "config": [{"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 8, 8, 512], "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "units": 256, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_constraint": null, "units": 67, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}], "class_name": "Sequential", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}], "output_layers": [["sequential_1", 1, 0]]}, "backend": "tensorflow"}