{"config": {"name": "model_1", "output_layers": [["sequential_1", 1, 0]], "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 96, 96, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"name": "block1_conv1", "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"name": "block1_conv2", "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"name": "block1_pool", "pool_size": [2, 2], "trainable": false, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"name": "block2_conv1", "bias_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"name": "block2_conv2", "bias_regularizer": null, "filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"name": "block2_pool", "pool_size": [2, 2], "trainable": false, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"name": "block3_conv1", "bias_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"name": "block3_conv2", "bias_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"name": "block3_conv3", "bias_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_conv4", "config": {"name": "block3_conv4", "bias_regularizer": null, "filters": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"name": "block3_pool", "pool_size": [2, 2], "trainable": false, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"name": "block4_conv1", "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"name": "block4_conv2", "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"name": "block4_conv3", "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_conv4", "config": {"name": "block4_conv4", "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"name": "block4_pool", "pool_size": [2, 2], "trainable": false, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"name": "block5_conv1", "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": false, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"name": "block5_conv2", "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"name": "block5_conv3", "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_conv4", "config": {"name": "block5_conv4", "bias_regularizer": null, "filters": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"name": "block5_pool", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}, {"name": "sequential_1", "config": [{"config": {"name": "flatten_1", "batch_input_shape": [null, 3, 3, 512], "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 256, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "units": 157, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.6"}